---
type: ApplicationException
namespace: Autodesk.Revit.Exceptions
version: 2024
members: 2
tags: [revit-api, class]
---

# ApplicationException

`Autodesk.Revit.Exceptions.ApplicationException` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetObjectData | — | `public override void GetObjectData ( SerializationInfo info , StreamingContext context )` |
| Property | FunctionId | — | `public FunctionId FunctionId { get ; }` |